Masmiseim36/nxpSDK/devices/MKE12Z7/MKE12Z7.xml
              <description>Reserved iv 40 interrupt set-pending bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND24_0</name>
                  <description>write: no effect; read: Reserved iv 40 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND24_1</name>
                  <description>write: changes the Reserved iv 40 interrupt state to pending; read: Reserved iv 40 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND25</name>
              <description>Reserved iv 41 interrupt set-pending bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND25_0</name>
                  <description>write: no effect; read: Reserved iv 41 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND25_1</name>
                  <description>write: changes the Reserved iv 41 interrupt state to pending; read: Reserved iv 41 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND26</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND26_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND26_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND27</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND27_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND27_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND28</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND28_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND28_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND29</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND29_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND29_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND30</name>
              <description>Reserved iv 46 interrupt set-pending bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND30_0</name>
                  <description>write: no effect; read: Reserved iv 46 interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND30_1</name>
                  <description>write: changes the Reserved iv 46 interrupt state to pending; read: Reserved iv 46 interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND31</name>
              <description>interrupt set-pending bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPEND31_0</name>
                  <description>write: no effect; read: interrupt is not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPEND31_1</name>
                  <description>write: changes the interrupt state to pending; read: interrupt is pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
